{
  "Navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "LocaleSwitcher": {
    "locale": "{locale, select, de {De} en {En} other {Unknown}}"
  },
  "Homepage": {
    "greeting": "Hi! I'm Fanni. {br} A Developer.",
    "introduction": "I'm a Java Backend Developer with a solid scientific background.",
    "hero-title": "Language Learning Platform",
    "hero-description": "During my studies at Greenfox Academy, my groupmates and I created a Language Learning Platform – a small project similar to Duolingo. Our main goal was to learn new programming features by building our first real webpage.",
    "button": "CASE STUDY",
    "todo-title": "To-do application",
    "todo-description": "I created this Java Spring Boot application with my groupmates during my studies at Greenfox Academy. It demonstrates my Java developement and backend architecture skills, focusing on clean code and optimal performace.",
    "library-title": "Simple Library",
    "library-description": "It is also one of my Greenfox Academy group projects. It was written in Java with a MySQL database for storing data about books like title, author and publising date. It also has a search bar to search for an exact book.",
    "pixam-title": "Pixam",
    "pixam-description": "One of my first little Java Backend project of my time at Greenfox Academy. We were getting in touch with MySQL and databases in general, and played around with them. It simulates a very simple pizza ordering application."
  },
  "Projects": {
    "details": "<h5>Project Overview</h5><p>Language Learning Platform is a project developed as part of the Project Phase at Green Fox Academy. It is an interactive web-based application designed to make learning a new language easy, fun, and addictive. The platform offers a range of features that are designed to help users learn new vocabulary and phrases in a foreign language of their choosing.</p><h5>Features</h5><h4>Interactive Learning</h4><p>The platform offers a range of interactive learning features that make learning a new language fun and engaging. Users can learn new words and phrases through images, sounds, and example sentences. Each word is presented in context, so users can see how it is used in real-life situations.</p><h4>Gamification</h4><p>To make learning even more addictive, the platform includes a range of gamification features. Users earn points for learning new words and completing activities, and can compete against friends and other learners on the platform.</p><h4>User-Generated Content</h4><p>One unique feature of the Language Learning Platform is that users can contribute their own words and phrases to the platform. This means that the platform is constantly growing and evolving, as new words and languages are added by users from all around the world.</p><h4>Progress Tracking</h4><p>Users can track their progress in each language they are learning, including the number of words they have learned and their overall proficiency in the language. This feature helps users to stay motivated and on track as they work towards their language learning goals.</p><h4>Customization</h4><p>The platform allows users to customize their learning experience to suit their individual needs. Users can set their own learning goals, choose the languages they want to learn, and even create their own custom word lists.</p><h4>Getting Started</h4><p>To get started with the Language Learning Platform, simply sign up for an account and choose the language you want to learn. From there, you can start learning new words and phrases, earn points, and track your progress.</p><h5>Technologies Used</h5>",
    "github-title": "See on GitHub",
    "project-link": "Project Link",
    "last-update": "Last update",
    "todo-details": "<h5>Project Overview: To-do Application with Java Spring Boot</h5><p>Our To-do application, developed as a collaborative effort during my studies at Greenfox Academy, is a Java Spring Boot project that demonstrates proficiency in Java development and backend architecture. The application focuses on providing a user-friendly interface for managing tasks efficiently.</p><p>The To-do application serves as a testament to my skills in Java development, backend architecture, and collaborative project execution. It stands as a valuable addition to my portfolio, highlighting both individual and teamwork capabilities in software development.</p><h5>Features</h5><h4>Task Management</h4><p>The application enables users to create, update, and delete tasks, offering a comprehensive solution for organizing daily activities.</p><h4>Java Spring Boot Framework</h4><p>Leveraging the power of the Spring Boot framework, our project ensures a scalable and maintainable backend architecture, facilitating seamless integration of new features.</p><h4>Clean Code Practices</h4><p>Prioritizing code readability and maintainability, the project adheres to clean code practices, making it not only functional but also easy to understand and extend.</p><h5>Technologies Used</h5>",
    "library": "<h5>Project Overview</h5><p>Our Basic Library Application, created collaboratively during my studies at Greenfox Academy, is a Java Spring Boot project designed to facilitate the management of book records. The application allows users to save new books in the database, capturing essential details such as title, author, and publishing date.</p><h5>Features</h5><h4>Book Management</h4><p>Users can add new books to the library, providing key information like title, author, and publishing date. This feature ensures a simple and intuitive way to organize and catalog literary collections.</p><h5>Technologies Used</h5>",
    "library-title": "Basic Library Application",
    "pixam-details": "<h5>Project Overview</h5><p>Our Simple Pizza Ordering Application, developed collaboratively during my studies at Greenfox Academy, is a Java Spring Boot project aimed at providing a streamlined and intuitive platform for users to place pizza orders. The application offers essential features for selecting pizza options, customizing orders, and completing the ordering process.</p><h5>Technologies Used</h5>"
  },
  "Contact": {
    "greeting": "Hello!",
    "text": "If you would like to contanct me, please try one of these links:",
    "sidenote": "You can find my portfolio on Github"
  },
  "About": {
    "short-intro": "I'm Fanni.",
    "short-title1": "I'm looking for my dream job in ",
    "short-title2": "°C Igis, Switzerland.",
    "intro": "Over the last few years I was living in Austria, and I wanted to make my dreams to be a developer come true, so I took an online course. I've learned in the University during my studies as a Physicist, that with hard work, dedication and persistence I can reach my goals. So here I am now, presenting to you my first webpage, what I created myself."
  },
  "References": {
    "studies-title": "My Studies.",
    "position-greenfox": "JUNIOR BACKEND ENGINEER",
    "phases": "Workshop phase (23 weeks): Java, Spring Boot, MySQL, Spring Data JPA {br} Project phase (16 weeks): NextJs, React, Tailwind, Bootstrap, Java, MySQL, Prisma, TypeScript, Github, Thymeleaf, Spring, Jira, Agile",
    "eotvos-uni": "Eötvös Loránd University",
    "eotvos-posi": "BIOPHYSICS, MSc",
    "eotvos-place": "Hungary, Budapest",
    "pecs-uni": "University Of Pécs",
    "pecs-posi": "PHYSICS, BSc",
    "pecs-place": "Hungary, Pécs",
    "xperience-title": "My Xperiences.",
    "focuson-posi": "QUALITY CONTROLLER",
    "focuson-place": "Austria, Eberstalzell",
    "focuson-content": "Ensured consistent quality by inspecting products according to established standards",
    "tomi-posi": "OFFICE OPERATIONS MANAGER",
    "tomi-place": "Hungary, Pécs",
    "tomi-content": "Coordinating and optimizing workflows across different departments (logistics, resource managemnet)",
    "mta-title": "HUNGARIAN ACADEMY OF SCIENCES, {br} BIOLOGICAL RESEARCH CENTRE",
    "mta-posi": "RESEARCH INTERN",
    "mta-place": "Hungary, Szeged",
    "mta-content": "Conducting experiments, collecting data {br} Investigating complex biophysical interactions {br} Analyzing experimental results, drawing meaningful conclusions, implementing protocols"
  }
}
